grevaillot/svd_tools/headers/ATSAMR34J16B/rtc.h
#pragma once 

/* --- RTC: Real-Time Counter --------------------------------------- */

/** @defgroup rtc_registers Real-Time Counter Register
@{*/

/** RTC_MODE0_CTRLA MODE0 Control A **/
#define RTC_MODE0_CTRLA			MMIO32(RTC_BASE + 0x00)
/** RTC_MODE1_CTRLA MODE1 Control A **/
#define RTC_MODE1_CTRLA			MMIO32(RTC_BASE + 0x00)
/** RTC_MODE2_CTRLA MODE2 Control A **/
#define RTC_MODE2_CTRLA			MMIO32(RTC_BASE + 0x00)
/** RTC_MODE0_EVCTRL MODE0 Event Control **/
#define RTC_MODE0_EVCTRL			MMIO32(RTC_BASE + 0x04)
/** RTC_MODE1_EVCTRL MODE1 Event Control **/
#define RTC_MODE1_EVCTRL			MMIO32(RTC_BASE + 0x04)
/** RTC_MODE2_EVCTRL MODE2 Event Control **/
#define RTC_MODE2_EVCTRL			MMIO32(RTC_BASE + 0x04)
/** RTC_MODE0_INTENCLR MODE0 Interrupt Enable Clear **/
#define RTC_MODE0_INTENCLR			MMIO32(RTC_BASE + 0x08)
/** RTC_MODE1_INTENCLR MODE1 Interrupt Enable Clear **/
#define RTC_MODE1_INTENCLR			MMIO32(RTC_BASE + 0x08)
/** RTC_MODE2_INTENCLR MODE2 Interrupt Enable Clear **/
#define RTC_MODE2_INTENCLR			MMIO32(RTC_BASE + 0x08)
/** RTC_MODE0_INTENSET MODE0 Interrupt Enable Set **/
#define RTC_MODE0_INTENSET			MMIO32(RTC_BASE + 0x0a)
/** RTC_MODE1_INTENSET MODE1 Interrupt Enable Set **/
#define RTC_MODE1_INTENSET			MMIO32(RTC_BASE + 0x0a)
/** RTC_MODE2_INTENSET MODE2 Interrupt Enable Set **/
#define RTC_MODE2_INTENSET			MMIO32(RTC_BASE + 0x0a)
/** RTC_MODE0_INTFLAG MODE0 Interrupt Flag Status and Clear **/
#define RTC_MODE0_INTFLAG			MMIO32(RTC_BASE + 0x0c)
/** RTC_MODE1_INTFLAG MODE1 Interrupt Flag Status and Clear **/
#define RTC_MODE1_INTFLAG			MMIO32(RTC_BASE + 0x0c)
/** RTC_MODE2_INTFLAG MODE2 Interrupt Flag Status and Clear **/
#define RTC_MODE2_INTFLAG			MMIO32(RTC_BASE + 0x0c)
/** RTC_MODE0_DBGCTRL Debug Control **/
#define RTC_MODE0_DBGCTRL			MMIO32(RTC_BASE + 0x0e)
/** RTC_MODE1_DBGCTRL Debug Control **/
#define RTC_MODE1_DBGCTRL			MMIO32(RTC_BASE + 0x0e)
/** RTC_MODE2_DBGCTRL Debug Control **/
#define RTC_MODE2_DBGCTRL			MMIO32(RTC_BASE + 0x0e)
/** RTC_MODE0_SYNCBUSY MODE0 Synchronization Busy Status **/
#define RTC_MODE0_SYNCBUSY			MMIO32(RTC_BASE + 0x10)
/** RTC_MODE1_SYNCBUSY MODE1 Synchronization Busy Status **/
#define RTC_MODE1_SYNCBUSY			MMIO32(RTC_BASE + 0x10)
/** RTC_MODE2_SYNCBUSY MODE2 Synchronization Busy Status **/
#define RTC_MODE2_SYNCBUSY			MMIO32(RTC_BASE + 0x10)
/** RTC_MODE0_FREQCORR Frequency Correction **/
#define RTC_MODE0_FREQCORR			MMIO32(RTC_BASE + 0x14)
/** RTC_MODE1_FREQCORR Frequency Correction **/
#define RTC_MODE1_FREQCORR			MMIO32(RTC_BASE + 0x14)
/** RTC_MODE2_FREQCORR Frequency Correction **/
#define RTC_MODE2_FREQCORR			MMIO32(RTC_BASE + 0x14)
/** RTC_MODE0_COUNT MODE0 Counter Value **/
#define RTC_MODE0_COUNT			MMIO32(RTC_BASE + 0x18)
/** RTC_MODE1_COUNT MODE1 Counter Value **/
#define RTC_MODE1_COUNT			MMIO32(RTC_BASE + 0x18)
/** RTC_MODE2_CLOCK MODE2 Clock Value **/
#define RTC_MODE2_CLOCK			MMIO32(RTC_BASE + 0x18)
/** RTC_MODE1_PER MODE1 Counter Period **/
#define RTC_MODE1_PER			MMIO32(RTC_BASE + 0x1c)
/** RTC_MODE0_COMP%s MODE0 Compare n Value **/
#define RTC_MODE0_COMP%s			MMIO32(RTC_BASE + 0x20)
/** RTC_MODE1_COMP%s MODE1 Compare n Value **/
#define RTC_MODE1_COMP%s			MMIO32(RTC_BASE + 0x20)
/** RTC_MODE2_ALARM%s MODE2 Alarm n Value **/
#define RTC_MODE2_ALARM%s			MMIO32(RTC_BASE + 0x20)
/** RTC_MODE2_MASK%s MODE2 Alarm n Mask **/
#define RTC_MODE2_MASK%s			MMIO32(RTC_BASE + 0x24)
/** RTC_MODE0_GP%s General Purpose **/
#define RTC_MODE0_GP%s			MMIO32(RTC_BASE + 0x40)
/** RTC_MODE1_GP%s General Purpose **/
#define RTC_MODE1_GP%s			MMIO32(RTC_BASE + 0x40)
/** RTC_MODE2_GP%s General Purpose **/
#define RTC_MODE2_GP%s			MMIO32(RTC_BASE + 0x40)

/**@}*/


/** @defgroup rtc_mode0_ctrla MODE0CTRLA MODE0 Control A
@{*/

/** RTC_MODE0_CTRLA_COUNTSYNC Count Read Synchronization Enable **/
#define RTC_MODE0_CTRLA_COUNTSYNC		(1 << 15)

#define RTC_MODE0_CTRLA_PRESCALER_SHIFT		8
#define RTC_MODE0_CTRLA_PRESCALER_MASK		0x0f
/** @defgroup rtc_mode0_ctrla_prescaler PRESCALER Prescaler
@{*/
/**@}*/

/** RTC_MODE0_CTRLA_MATCHCLR Clear on Match **/
#define RTC_MODE0_CTRLA_MATCHCLR		(1 << 7)

#define RTC_MODE0_CTRLA_MODE_SHIFT		2
#define RTC_MODE0_CTRLA_MODE_MASK		0x03
/** @defgroup rtc_mode0_ctrla_mode MODE Operating Mode
@{*/
/**@}*/

/** RTC_MODE0_CTRLA_ENABLE Enable **/
#define RTC_MODE0_CTRLA_ENABLE		(1 << 1)
/** RTC_MODE0_CTRLA_SWRST Software Reset **/
#define RTC_MODE0_CTRLA_SWRST		(1 << 0)

/**@}*/

/** @defgroup rtc_mode1_ctrla MODE1CTRLA MODE1 Control A
@{*/

/** RTC_MODE1_CTRLA_COUNTSYNC Count Read Synchronization Enable **/
#define RTC_MODE1_CTRLA_COUNTSYNC		(1 << 15)

#define RTC_MODE1_CTRLA_PRESCALER_SHIFT		8
#define RTC_MODE1_CTRLA_PRESCALER_MASK		0x0f
/** @defgroup rtc_mode1_ctrla_prescaler PRESCALER Prescaler
@{*/
/**@}*/


#define RTC_MODE1_CTRLA_MODE_SHIFT		2
#define RTC_MODE1_CTRLA_MODE_MASK		0x03
/** @defgroup rtc_mode1_ctrla_mode MODE Operating Mode
@{*/
/**@}*/

/** RTC_MODE1_CTRLA_ENABLE Enable **/
#define RTC_MODE1_CTRLA_ENABLE		(1 << 1)
/** RTC_MODE1_CTRLA_SWRST Software Reset **/
#define RTC_MODE1_CTRLA_SWRST		(1 << 0)

/**@}*/

/** @defgroup rtc_mode2_ctrla MODE2CTRLA MODE2 Control A
@{*/

/** RTC_MODE2_CTRLA_CLOCKSYNC Clock Read Synchronization Enable **/
#define RTC_MODE2_CTRLA_CLOCKSYNC		(1 << 15)

#define RTC_MODE2_CTRLA_PRESCALER_SHIFT		8
#define RTC_MODE2_CTRLA_PRESCALER_MASK		0x0f
/** @defgroup rtc_mode2_ctrla_prescaler PRESCALER Prescaler
@{*/
/**@}*/

/** RTC_MODE2_CTRLA_MATCHCLR Clear on Match **/
#define RTC_MODE2_CTRLA_MATCHCLR		(1 << 7)
/** RTC_MODE2_CTRLA_CLKREP Clock Representation **/
#define RTC_MODE2_CTRLA_CLKREP		(1 << 6)

#define RTC_MODE2_CTRLA_MODE_SHIFT		2
#define RTC_MODE2_CTRLA_MODE_MASK		0x03
/** @defgroup rtc_mode2_ctrla_mode MODE Operating Mode
@{*/
/**@}*/

/** RTC_MODE2_CTRLA_ENABLE Enable **/
#define RTC_MODE2_CTRLA_ENABLE		(1 << 1)
/** RTC_MODE2_CTRLA_SWRST Software Reset **/
#define RTC_MODE2_CTRLA_SWRST		(1 << 0)

/**@}*/

/** @defgroup rtc_mode0_evctrl MODE0EVCTRL MODE0 Event Control
@{*/

/** RTC_MODE0_EVCTRL_OVFEO Overflow Event Output Enable **/
#define RTC_MODE0_EVCTRL_OVFEO		(1 << 15)
/** RTC_MODE0_EVCTRL_CMPEO0 Compare 0 Event Output Enable **/
#define RTC_MODE0_EVCTRL_CMPEO0		(1 << 8)
/** RTC_MODE0_EVCTRL_PEREO7 Periodic Interval 7 Event Output Enable **/
#define RTC_MODE0_EVCTRL_PEREO7		(1 << 7)
/** RTC_MODE0_EVCTRL_PEREO6 Periodic Interval 6 Event Output Enable **/
#define RTC_MODE0_EVCTRL_PEREO6		(1 << 6)
/** RTC_MODE0_EVCTRL_PEREO5 Periodic Interval 5 Event Output Enable **/
#define RTC_MODE0_EVCTRL_PEREO5		(1 << 5)
/** RTC_MODE0_EVCTRL_PEREO4 Periodic Interval 4 Event Output Enable **/
#define RTC_MODE0_EVCTRL_PEREO4		(1 << 4)
/** RTC_MODE0_EVCTRL_PEREO3 Periodic Interval 3 Event Output Enable **/
#define RTC_MODE0_EVCTRL_PEREO3		(1 << 3)
/** RTC_MODE0_EVCTRL_PEREO2 Periodic Interval 2 Event Output Enable **/
#define RTC_MODE0_EVCTRL_PEREO2		(1 << 2)
/** RTC_MODE0_EVCTRL_PEREO1 Periodic Interval 1 Event Output Enable **/
#define RTC_MODE0_EVCTRL_PEREO1		(1 << 1)
/** RTC_MODE0_EVCTRL_PEREO0 Periodic Interval 0 Event Output Enable **/
#define RTC_MODE0_EVCTRL_PEREO0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode1_evctrl MODE1EVCTRL MODE1 Event Control
@{*/

/** RTC_MODE1_EVCTRL_OVFEO Overflow Event Output Enable **/
#define RTC_MODE1_EVCTRL_OVFEO		(1 << 15)
/** RTC_MODE1_EVCTRL_CMPEO1 Compare 1 Event Output Enable **/
#define RTC_MODE1_EVCTRL_CMPEO1		(1 << 9)
/** RTC_MODE1_EVCTRL_CMPEO0 Compare 0 Event Output Enable **/
#define RTC_MODE1_EVCTRL_CMPEO0		(1 << 8)
/** RTC_MODE1_EVCTRL_PEREO7 Periodic Interval 7 Event Output Enable **/
#define RTC_MODE1_EVCTRL_PEREO7		(1 << 7)
/** RTC_MODE1_EVCTRL_PEREO6 Periodic Interval 6 Event Output Enable **/
#define RTC_MODE1_EVCTRL_PEREO6		(1 << 6)
/** RTC_MODE1_EVCTRL_PEREO5 Periodic Interval 5 Event Output Enable **/
#define RTC_MODE1_EVCTRL_PEREO5		(1 << 5)
/** RTC_MODE1_EVCTRL_PEREO4 Periodic Interval 4 Event Output Enable **/
#define RTC_MODE1_EVCTRL_PEREO4		(1 << 4)
/** RTC_MODE1_EVCTRL_PEREO3 Periodic Interval 3 Event Output Enable **/
#define RTC_MODE1_EVCTRL_PEREO3		(1 << 3)
/** RTC_MODE1_EVCTRL_PEREO2 Periodic Interval 2 Event Output Enable **/
#define RTC_MODE1_EVCTRL_PEREO2		(1 << 2)
/** RTC_MODE1_EVCTRL_PEREO1 Periodic Interval 1 Event Output Enable **/
#define RTC_MODE1_EVCTRL_PEREO1		(1 << 1)
/** RTC_MODE1_EVCTRL_PEREO0 Periodic Interval 0 Event Output Enable **/
#define RTC_MODE1_EVCTRL_PEREO0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode2_evctrl MODE2EVCTRL MODE2 Event Control
@{*/

