grevaillot/svd_tools/headers/ATSAMR34J16B/rtc.h
/** RTC_MODE2_EVCTRL_OVFEO Overflow Event Output Enable **/
#define RTC_MODE2_EVCTRL_OVFEO		(1 << 15)
/** RTC_MODE2_EVCTRL_ALARMEO0 Alarm 0 Event Output Enable **/
#define RTC_MODE2_EVCTRL_ALARMEO0		(1 << 8)
/** RTC_MODE2_EVCTRL_PEREO7 Periodic Interval 7 Event Output Enable **/
#define RTC_MODE2_EVCTRL_PEREO7		(1 << 7)
/** RTC_MODE2_EVCTRL_PEREO6 Periodic Interval 6 Event Output Enable **/
#define RTC_MODE2_EVCTRL_PEREO6		(1 << 6)
/** RTC_MODE2_EVCTRL_PEREO5 Periodic Interval 5 Event Output Enable **/
#define RTC_MODE2_EVCTRL_PEREO5		(1 << 5)
/** RTC_MODE2_EVCTRL_PEREO4 Periodic Interval 4 Event Output Enable **/
#define RTC_MODE2_EVCTRL_PEREO4		(1 << 4)
/** RTC_MODE2_EVCTRL_PEREO3 Periodic Interval 3 Event Output Enable **/
#define RTC_MODE2_EVCTRL_PEREO3		(1 << 3)
/** RTC_MODE2_EVCTRL_PEREO2 Periodic Interval 2 Event Output Enable **/
#define RTC_MODE2_EVCTRL_PEREO2		(1 << 2)
/** RTC_MODE2_EVCTRL_PEREO1 Periodic Interval 1 Event Output Enable **/
#define RTC_MODE2_EVCTRL_PEREO1		(1 << 1)
/** RTC_MODE2_EVCTRL_PEREO0 Periodic Interval 0 Event Output Enable **/
#define RTC_MODE2_EVCTRL_PEREO0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode0_intenclr MODE0INTENCLR MODE0 Interrupt Enable Clear
@{*/

/** RTC_MODE0_INTENCLR_OVF Overflow Interrupt Enable **/
#define RTC_MODE0_INTENCLR_OVF		(1 << 15)
/** RTC_MODE0_INTENCLR_CMP0 Compare 0 Interrupt Enable **/
#define RTC_MODE0_INTENCLR_CMP0		(1 << 8)
/** RTC_MODE0_INTENCLR_PER7 Periodic Interval 7 Interrupt Enable **/
#define RTC_MODE0_INTENCLR_PER7		(1 << 7)
/** RTC_MODE0_INTENCLR_PER6 Periodic Interval 6 Interrupt Enable **/
#define RTC_MODE0_INTENCLR_PER6		(1 << 6)
/** RTC_MODE0_INTENCLR_PER5 Periodic Interval 5 Interrupt Enable **/
#define RTC_MODE0_INTENCLR_PER5		(1 << 5)
/** RTC_MODE0_INTENCLR_PER4 Periodic Interval 4 Interrupt Enable **/
#define RTC_MODE0_INTENCLR_PER4		(1 << 4)
/** RTC_MODE0_INTENCLR_PER3 Periodic Interval 3 Interrupt Enable **/
#define RTC_MODE0_INTENCLR_PER3		(1 << 3)
/** RTC_MODE0_INTENCLR_PER2 Periodic Interval 2 Interrupt Enable **/
#define RTC_MODE0_INTENCLR_PER2		(1 << 2)
/** RTC_MODE0_INTENCLR_PER1 Periodic Interval 1 Interrupt Enable **/
#define RTC_MODE0_INTENCLR_PER1		(1 << 1)
/** RTC_MODE0_INTENCLR_PER0 Periodic Interval 0 Interrupt Enable **/
#define RTC_MODE0_INTENCLR_PER0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode1_intenclr MODE1INTENCLR MODE1 Interrupt Enable Clear
@{*/

/** RTC_MODE1_INTENCLR_OVF Overflow Interrupt Enable **/
#define RTC_MODE1_INTENCLR_OVF		(1 << 15)
/** RTC_MODE1_INTENCLR_CMP1 Compare 1 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_CMP1		(1 << 9)
/** RTC_MODE1_INTENCLR_CMP0 Compare 0 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_CMP0		(1 << 8)
/** RTC_MODE1_INTENCLR_PER7 Periodic Interval 7 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_PER7		(1 << 7)
/** RTC_MODE1_INTENCLR_PER6 Periodic Interval 6 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_PER6		(1 << 6)
/** RTC_MODE1_INTENCLR_PER5 Periodic Interval 5 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_PER5		(1 << 5)
/** RTC_MODE1_INTENCLR_PER4 Periodic Interval 4 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_PER4		(1 << 4)
/** RTC_MODE1_INTENCLR_PER3 Periodic Interval 3 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_PER3		(1 << 3)
/** RTC_MODE1_INTENCLR_PER2 Periodic Interval 2 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_PER2		(1 << 2)
/** RTC_MODE1_INTENCLR_PER1 Periodic Interval 1 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_PER1		(1 << 1)
/** RTC_MODE1_INTENCLR_PER0 Periodic Interval 0 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_PER0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode2_intenclr MODE2INTENCLR MODE2 Interrupt Enable Clear
@{*/

/** RTC_MODE2_INTENCLR_OVF Overflow Interrupt Enable **/
#define RTC_MODE2_INTENCLR_OVF		(1 << 15)
/** RTC_MODE2_INTENCLR_ALARM0 Alarm 0 Interrupt Enable **/
#define RTC_MODE2_INTENCLR_ALARM0		(1 << 8)
/** RTC_MODE2_INTENCLR_PER7 Periodic Interval 7 Interrupt Enable **/
#define RTC_MODE2_INTENCLR_PER7		(1 << 7)
/** RTC_MODE2_INTENCLR_PER6 Periodic Interval 6 Interrupt Enable **/
#define RTC_MODE2_INTENCLR_PER6		(1 << 6)
/** RTC_MODE2_INTENCLR_PER5 Periodic Interval 5 Interrupt Enable **/
#define RTC_MODE2_INTENCLR_PER5		(1 << 5)
/** RTC_MODE2_INTENCLR_PER4 Periodic Interval 4 Interrupt Enable **/
#define RTC_MODE2_INTENCLR_PER4		(1 << 4)
/** RTC_MODE2_INTENCLR_PER3 Periodic Interval 3 Interrupt Enable **/
#define RTC_MODE2_INTENCLR_PER3		(1 << 3)
/** RTC_MODE2_INTENCLR_PER2 Periodic Interval 2 Interrupt Enable **/
#define RTC_MODE2_INTENCLR_PER2		(1 << 2)
/** RTC_MODE2_INTENCLR_PER1 Periodic Interval 1 Interrupt Enable **/
#define RTC_MODE2_INTENCLR_PER1		(1 << 1)
/** RTC_MODE2_INTENCLR_PER0 Periodic Interval 0 Interrupt Enable **/
#define RTC_MODE2_INTENCLR_PER0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode0_intenset MODE0INTENSET MODE0 Interrupt Enable Set
@{*/

/** RTC_MODE0_INTENSET_OVF Overflow Interrupt Enable **/
#define RTC_MODE0_INTENSET_OVF		(1 << 15)
/** RTC_MODE0_INTENSET_CMP0 Compare 0 Interrupt Enable **/
#define RTC_MODE0_INTENSET_CMP0		(1 << 8)
/** RTC_MODE0_INTENSET_PER7 Periodic Interval 7 Interrupt Enable **/
#define RTC_MODE0_INTENSET_PER7		(1 << 7)
/** RTC_MODE0_INTENSET_PER6 Periodic Interval 6 Interrupt Enable **/
#define RTC_MODE0_INTENSET_PER6		(1 << 6)
/** RTC_MODE0_INTENSET_PER5 Periodic Interval 5 Interrupt Enable **/
#define RTC_MODE0_INTENSET_PER5		(1 << 5)
/** RTC_MODE0_INTENSET_PER4 Periodic Interval 4 Interrupt Enable **/
#define RTC_MODE0_INTENSET_PER4		(1 << 4)
/** RTC_MODE0_INTENSET_PER3 Periodic Interval 3 Interrupt Enable **/
#define RTC_MODE0_INTENSET_PER3		(1 << 3)
/** RTC_MODE0_INTENSET_PER2 Periodic Interval 2 Interrupt Enable **/
#define RTC_MODE0_INTENSET_PER2		(1 << 2)
/** RTC_MODE0_INTENSET_PER1 Periodic Interval 1 Interrupt Enable **/
#define RTC_MODE0_INTENSET_PER1		(1 << 1)
/** RTC_MODE0_INTENSET_PER0 Periodic Interval 0 Interrupt Enable **/
#define RTC_MODE0_INTENSET_PER0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode1_intenset MODE1INTENSET MODE1 Interrupt Enable Set
@{*/

/** RTC_MODE1_INTENSET_OVF Overflow Interrupt Enable **/
#define RTC_MODE1_INTENSET_OVF		(1 << 15)
/** RTC_MODE1_INTENSET_CMP1 Compare 1 Interrupt Enable **/
#define RTC_MODE1_INTENSET_CMP1		(1 << 9)
/** RTC_MODE1_INTENSET_CMP0 Compare 0 Interrupt Enable **/
#define RTC_MODE1_INTENSET_CMP0		(1 << 8)
/** RTC_MODE1_INTENSET_PER7 Periodic Interval 7 Interrupt Enable **/
#define RTC_MODE1_INTENSET_PER7		(1 << 7)
/** RTC_MODE1_INTENSET_PER6 Periodic Interval 6 Interrupt Enable **/
#define RTC_MODE1_INTENSET_PER6		(1 << 6)
/** RTC_MODE1_INTENSET_PER5 Periodic Interval 5 Interrupt Enable **/
#define RTC_MODE1_INTENSET_PER5		(1 << 5)
/** RTC_MODE1_INTENSET_PER4 Periodic Interval 4 Interrupt Enable **/
#define RTC_MODE1_INTENSET_PER4		(1 << 4)
/** RTC_MODE1_INTENSET_PER3 Periodic Interval 3 Interrupt Enable **/
#define RTC_MODE1_INTENSET_PER3		(1 << 3)
/** RTC_MODE1_INTENSET_PER2 Periodic Interval 2 Interrupt Enable **/
#define RTC_MODE1_INTENSET_PER2		(1 << 2)
/** RTC_MODE1_INTENSET_PER1 Periodic Interval 1 Interrupt Enable **/
#define RTC_MODE1_INTENSET_PER1		(1 << 1)
/** RTC_MODE1_INTENSET_PER0 Periodic Interval 0 Interrupt Enable **/
#define RTC_MODE1_INTENSET_PER0		(1 << 0)

/**@}*/

