grevaillot/svd_tools/headers/ATSAMR34J16B/rtc.h
/** @defgroup rtc_mode2_intenset MODE2INTENSET MODE2 Interrupt Enable Set
@{*/

/** RTC_MODE2_INTENSET_OVF Overflow Interrupt Enable **/
#define RTC_MODE2_INTENSET_OVF		(1 << 15)
/** RTC_MODE2_INTENSET_ALARM0 Alarm 0 Interrupt Enable **/
#define RTC_MODE2_INTENSET_ALARM0		(1 << 8)
/** RTC_MODE2_INTENSET_PER7 Periodic Interval 7 Enable **/
#define RTC_MODE2_INTENSET_PER7		(1 << 7)
/** RTC_MODE2_INTENSET_PER6 Periodic Interval 6 Enable **/
#define RTC_MODE2_INTENSET_PER6		(1 << 6)
/** RTC_MODE2_INTENSET_PER5 Periodic Interval 5 Enable **/
#define RTC_MODE2_INTENSET_PER5		(1 << 5)
/** RTC_MODE2_INTENSET_PER4 Periodic Interval 4 Enable **/
#define RTC_MODE2_INTENSET_PER4		(1 << 4)
/** RTC_MODE2_INTENSET_PER3 Periodic Interval 3 Enable **/
#define RTC_MODE2_INTENSET_PER3		(1 << 3)
/** RTC_MODE2_INTENSET_PER2 Periodic Interval 2 Enable **/
#define RTC_MODE2_INTENSET_PER2		(1 << 2)
/** RTC_MODE2_INTENSET_PER1 Periodic Interval 1 Enable **/
#define RTC_MODE2_INTENSET_PER1		(1 << 1)
/** RTC_MODE2_INTENSET_PER0 Periodic Interval 0 Enable **/
#define RTC_MODE2_INTENSET_PER0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode0_intflag MODE0INTFLAG MODE0 Interrupt Flag Status and Clear
@{*/

/** RTC_MODE0_INTFLAG_OVF Overflow **/
#define RTC_MODE0_INTFLAG_OVF		(1 << 15)
/** RTC_MODE0_INTFLAG_CMP0 Compare 0 **/
#define RTC_MODE0_INTFLAG_CMP0		(1 << 8)
/** RTC_MODE0_INTFLAG_PER7 Periodic Interval 7 **/
#define RTC_MODE0_INTFLAG_PER7		(1 << 7)
/** RTC_MODE0_INTFLAG_PER6 Periodic Interval 6 **/
#define RTC_MODE0_INTFLAG_PER6		(1 << 6)
/** RTC_MODE0_INTFLAG_PER5 Periodic Interval 5 **/
#define RTC_MODE0_INTFLAG_PER5		(1 << 5)
/** RTC_MODE0_INTFLAG_PER4 Periodic Interval 4 **/
#define RTC_MODE0_INTFLAG_PER4		(1 << 4)
/** RTC_MODE0_INTFLAG_PER3 Periodic Interval 3 **/
#define RTC_MODE0_INTFLAG_PER3		(1 << 3)
/** RTC_MODE0_INTFLAG_PER2 Periodic Interval 2 **/
#define RTC_MODE0_INTFLAG_PER2		(1 << 2)
/** RTC_MODE0_INTFLAG_PER1 Periodic Interval 1 **/
#define RTC_MODE0_INTFLAG_PER1		(1 << 1)
/** RTC_MODE0_INTFLAG_PER0 Periodic Interval 0 **/
#define RTC_MODE0_INTFLAG_PER0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode1_intflag MODE1INTFLAG MODE1 Interrupt Flag Status and Clear
@{*/

/** RTC_MODE1_INTFLAG_OVF Overflow **/
#define RTC_MODE1_INTFLAG_OVF		(1 << 15)
/** RTC_MODE1_INTFLAG_CMP1 Compare 1 **/
#define RTC_MODE1_INTFLAG_CMP1		(1 << 9)
/** RTC_MODE1_INTFLAG_CMP0 Compare 0 **/
#define RTC_MODE1_INTFLAG_CMP0		(1 << 8)
/** RTC_MODE1_INTFLAG_PER7 Periodic Interval 7 **/
#define RTC_MODE1_INTFLAG_PER7		(1 << 7)
/** RTC_MODE1_INTFLAG_PER6 Periodic Interval 6 **/
#define RTC_MODE1_INTFLAG_PER6		(1 << 6)
/** RTC_MODE1_INTFLAG_PER5 Periodic Interval 5 **/
#define RTC_MODE1_INTFLAG_PER5		(1 << 5)
/** RTC_MODE1_INTFLAG_PER4 Periodic Interval 4 **/
#define RTC_MODE1_INTFLAG_PER4		(1 << 4)
/** RTC_MODE1_INTFLAG_PER3 Periodic Interval 3 **/
#define RTC_MODE1_INTFLAG_PER3		(1 << 3)
/** RTC_MODE1_INTFLAG_PER2 Periodic Interval 2 **/
#define RTC_MODE1_INTFLAG_PER2		(1 << 2)
/** RTC_MODE1_INTFLAG_PER1 Periodic Interval 1 **/
#define RTC_MODE1_INTFLAG_PER1		(1 << 1)
/** RTC_MODE1_INTFLAG_PER0 Periodic Interval 0 **/
#define RTC_MODE1_INTFLAG_PER0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode2_intflag MODE2INTFLAG MODE2 Interrupt Flag Status and Clear
@{*/

/** RTC_MODE2_INTFLAG_OVF Overflow **/
#define RTC_MODE2_INTFLAG_OVF		(1 << 15)
/** RTC_MODE2_INTFLAG_ALARM0 Alarm 0 **/
#define RTC_MODE2_INTFLAG_ALARM0		(1 << 8)
/** RTC_MODE2_INTFLAG_PER7 Periodic Interval 7 **/
#define RTC_MODE2_INTFLAG_PER7		(1 << 7)
/** RTC_MODE2_INTFLAG_PER6 Periodic Interval 6 **/
#define RTC_MODE2_INTFLAG_PER6		(1 << 6)
/** RTC_MODE2_INTFLAG_PER5 Periodic Interval 5 **/
#define RTC_MODE2_INTFLAG_PER5		(1 << 5)
/** RTC_MODE2_INTFLAG_PER4 Periodic Interval 4 **/
#define RTC_MODE2_INTFLAG_PER4		(1 << 4)
/** RTC_MODE2_INTFLAG_PER3 Periodic Interval 3 **/
#define RTC_MODE2_INTFLAG_PER3		(1 << 3)
/** RTC_MODE2_INTFLAG_PER2 Periodic Interval 2 **/
#define RTC_MODE2_INTFLAG_PER2		(1 << 2)
/** RTC_MODE2_INTFLAG_PER1 Periodic Interval 1 **/
#define RTC_MODE2_INTFLAG_PER1		(1 << 1)
/** RTC_MODE2_INTFLAG_PER0 Periodic Interval 0 **/
#define RTC_MODE2_INTFLAG_PER0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode0_dbgctrl MODE0DBGCTRL Debug Control
@{*/

/** RTC_MODE0_DBGCTRL_DBGRUN Run During Debug **/
#define RTC_MODE0_DBGCTRL_DBGRUN		(1 << 0)

/**@}*/

/** @defgroup rtc_mode1_dbgctrl MODE1DBGCTRL Debug Control
@{*/

/** RTC_MODE1_DBGCTRL_DBGRUN Run During Debug **/
#define RTC_MODE1_DBGCTRL_DBGRUN		(1 << 0)

/**@}*/

/** @defgroup rtc_mode2_dbgctrl MODE2DBGCTRL Debug Control
@{*/

/** RTC_MODE2_DBGCTRL_DBGRUN Run During Debug **/
#define RTC_MODE2_DBGCTRL_DBGRUN		(1 << 0)

/**@}*/

/** @defgroup rtc_mode0_syncbusy MODE0SYNCBUSY MODE0 Synchronization Busy Status
@{*/

/** RTC_MODE0_SYNCBUSY_COUNTSYNC Count Read Synchronization Enable Bit Busy **/
#define RTC_MODE0_SYNCBUSY_COUNTSYNC		(1 << 15)
/** RTC_MODE0_SYNCBUSY_COMP0 COMP 0 Register Busy **/
#define RTC_MODE0_SYNCBUSY_COMP0		(1 << 5)
/** RTC_MODE0_SYNCBUSY_COUNT COUNT Register Busy **/
#define RTC_MODE0_SYNCBUSY_COUNT		(1 << 3)
/** RTC_MODE0_SYNCBUSY_FREQCORR FREQCORR Register Busy **/
#define RTC_MODE0_SYNCBUSY_FREQCORR		(1 << 2)
/** RTC_MODE0_SYNCBUSY_ENABLE Enable Bit Busy **/
#define RTC_MODE0_SYNCBUSY_ENABLE		(1 << 1)
/** RTC_MODE0_SYNCBUSY_SWRST Software Reset Busy **/
#define RTC_MODE0_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup rtc_mode1_syncbusy MODE1SYNCBUSY MODE1 Synchronization Busy Status
@{*/

/** RTC_MODE1_SYNCBUSY_COUNTSYNC Count Read Synchronization Enable Bit Busy **/
#define RTC_MODE1_SYNCBUSY_COUNTSYNC		(1 << 15)
/** RTC_MODE1_SYNCBUSY_COMP1 COMP 1 Register Busy **/
#define RTC_MODE1_SYNCBUSY_COMP1		(1 << 6)
/** RTC_MODE1_SYNCBUSY_COMP0 COMP 0 Register Busy **/
#define RTC_MODE1_SYNCBUSY_COMP0		(1 << 5)
/** RTC_MODE1_SYNCBUSY_PER PER Register Busy **/
#define RTC_MODE1_SYNCBUSY_PER		(1 << 4)
/** RTC_MODE1_SYNCBUSY_COUNT COUNT Register Busy **/
#define RTC_MODE1_SYNCBUSY_COUNT		(1 << 3)
/** RTC_MODE1_SYNCBUSY_FREQCORR FREQCORR Register Busy **/
#define RTC_MODE1_SYNCBUSY_FREQCORR		(1 << 2)
/** RTC_MODE1_SYNCBUSY_ENABLE Enable Bit Busy **/
#define RTC_MODE1_SYNCBUSY_ENABLE		(1 << 1)
/** RTC_MODE1_SYNCBUSY_SWRST Software Reset Bit Busy **/
#define RTC_MODE1_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup rtc_mode2_syncbusy MODE2SYNCBUSY MODE2 Synchronization Busy Status
@{*/

/** RTC_MODE2_SYNCBUSY_CLOCKSYNC Clock Read Synchronization Enable Bit Busy **/
#define RTC_MODE2_SYNCBUSY_CLOCKSYNC		(1 << 15)
/** RTC_MODE2_SYNCBUSY_MASK0 MASK 0 Register Busy **/
#define RTC_MODE2_SYNCBUSY_MASK0		(1 << 11)
/** RTC_MODE2_SYNCBUSY_ALARM0 ALARM 0 Register Busy **/
#define RTC_MODE2_SYNCBUSY_ALARM0		(1 << 5)
/** RTC_MODE2_SYNCBUSY_CLOCK CLOCK Register Busy **/
#define RTC_MODE2_SYNCBUSY_CLOCK		(1 << 3)
/** RTC_MODE2_SYNCBUSY_FREQCORR FREQCORR Register Busy **/
#define RTC_MODE2_SYNCBUSY_FREQCORR		(1 << 2)
/** RTC_MODE2_SYNCBUSY_ENABLE Enable Bit Busy **/
#define RTC_MODE2_SYNCBUSY_ENABLE		(1 << 1)
/** RTC_MODE2_SYNCBUSY_SWRST Software Reset Bit Busy **/
#define RTC_MODE2_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup rtc_mode0_freqcorr MODE0FREQCORR Frequency Correction
@{*/

/** RTC_MODE0_FREQCORR_SIGN Correction Sign **/
#define RTC_MODE0_FREQCORR_SIGN		(1 << 7)

