grevaillot/svd_tools/headers/ATSAMR34J16B/rtc.h
#define RTC_MODE0_FREQCORR_VALUE_SHIFT		0
#define RTC_MODE0_FREQCORR_VALUE_MASK		0x7f
/** @defgroup rtc_mode0_freqcorr_value VALUE Correction Value
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode1_freqcorr MODE1FREQCORR Frequency Correction
@{*/

/** RTC_MODE1_FREQCORR_SIGN Correction Sign **/
#define RTC_MODE1_FREQCORR_SIGN		(1 << 7)

#define RTC_MODE1_FREQCORR_VALUE_SHIFT		0
#define RTC_MODE1_FREQCORR_VALUE_MASK		0x7f
/** @defgroup rtc_mode1_freqcorr_value VALUE Correction Value
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode2_freqcorr MODE2FREQCORR Frequency Correction
@{*/

/** RTC_MODE2_FREQCORR_SIGN Correction Sign **/
#define RTC_MODE2_FREQCORR_SIGN		(1 << 7)

#define RTC_MODE2_FREQCORR_VALUE_SHIFT		0
#define RTC_MODE2_FREQCORR_VALUE_MASK		0x7f
/** @defgroup rtc_mode2_freqcorr_value VALUE Correction Value
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode0_count MODE0COUNT MODE0 Counter Value
@{*/


#define RTC_MODE0_COUNT_COUNT_SHIFT		0
#define RTC_MODE0_COUNT_COUNT_MASK		0xffffffff
/** @defgroup rtc_mode0_count_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode1_count MODE1COUNT MODE1 Counter Value
@{*/


#define RTC_MODE1_COUNT_COUNT_SHIFT		0
#define RTC_MODE1_COUNT_COUNT_MASK		0xffff
/** @defgroup rtc_mode1_count_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode2_clock MODE2CLOCK MODE2 Clock Value
@{*/


#define RTC_MODE2_CLOCK_YEAR_SHIFT		26
#define RTC_MODE2_CLOCK_YEAR_MASK		0x3f
/** @defgroup rtc_mode2_clock_year YEAR Year
@{*/
/**@}*/


#define RTC_MODE2_CLOCK_MONTH_SHIFT		22
#define RTC_MODE2_CLOCK_MONTH_MASK		0x0f
/** @defgroup rtc_mode2_clock_month MONTH Month
@{*/
/**@}*/


#define RTC_MODE2_CLOCK_DAY_SHIFT		17
#define RTC_MODE2_CLOCK_DAY_MASK		0x1f
/** @defgroup rtc_mode2_clock_day DAY Day
@{*/
/**@}*/


#define RTC_MODE2_CLOCK_HOUR_SHIFT		12
#define RTC_MODE2_CLOCK_HOUR_MASK		0x1f
/** @defgroup rtc_mode2_clock_hour HOUR Hour
@{*/
/**@}*/


#define RTC_MODE2_CLOCK_MINUTE_SHIFT		6
#define RTC_MODE2_CLOCK_MINUTE_MASK		0x3f
/** @defgroup rtc_mode2_clock_minute MINUTE Minute
@{*/
/**@}*/


#define RTC_MODE2_CLOCK_SECOND_SHIFT		0
#define RTC_MODE2_CLOCK_SECOND_MASK		0x3f
/** @defgroup rtc_mode2_clock_second SECOND Second
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode1_per MODE1PER MODE1 Counter Period
@{*/


#define RTC_MODE1_PER_PER_SHIFT		0
#define RTC_MODE1_PER_PER_MASK		0xffff
/** @defgroup rtc_mode1_per_per PER Counter Period
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode0_comp%s MODE0COMP%s MODE0 Compare n Value
@{*/


#define RTC_MODE0_COMP%s_COMP_SHIFT		0
#define RTC_MODE0_COMP%s_COMP_MASK		0xffffffff
/** @defgroup rtc_mode0_comp%s_comp COMP Compare Value
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode1_comp%s MODE1COMP%s MODE1 Compare n Value
@{*/


#define RTC_MODE1_COMP%s_COMP_SHIFT		0
#define RTC_MODE1_COMP%s_COMP_MASK		0xffff
/** @defgroup rtc_mode1_comp%s_comp COMP Compare Value
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode2_alarm%s MODE2ALARM%s MODE2 Alarm n Value
@{*/


#define RTC_MODE2_ALARM%s_YEAR_SHIFT		26
#define RTC_MODE2_ALARM%s_YEAR_MASK		0x3f
/** @defgroup rtc_mode2_alarm%s_year YEAR Year
@{*/
/**@}*/


#define RTC_MODE2_ALARM%s_MONTH_SHIFT		22
#define RTC_MODE2_ALARM%s_MONTH_MASK		0x0f
/** @defgroup rtc_mode2_alarm%s_month MONTH Month
@{*/
/**@}*/


#define RTC_MODE2_ALARM%s_DAY_SHIFT		17
#define RTC_MODE2_ALARM%s_DAY_MASK		0x1f
/** @defgroup rtc_mode2_alarm%s_day DAY Day
@{*/
/**@}*/


#define RTC_MODE2_ALARM%s_HOUR_SHIFT		12
#define RTC_MODE2_ALARM%s_HOUR_MASK		0x1f
/** @defgroup rtc_mode2_alarm%s_hour HOUR Hour
@{*/
/**@}*/


#define RTC_MODE2_ALARM%s_MINUTE_SHIFT		6
#define RTC_MODE2_ALARM%s_MINUTE_MASK		0x3f
/** @defgroup rtc_mode2_alarm%s_minute MINUTE Minute
@{*/
/**@}*/


#define RTC_MODE2_ALARM%s_SECOND_SHIFT		0
#define RTC_MODE2_ALARM%s_SECOND_MASK		0x3f
/** @defgroup rtc_mode2_alarm%s_second SECOND Second
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode2_mask%s MODE2MASK%s MODE2 Alarm n Mask
@{*/


#define RTC_MODE2_MASK%s_SEL_SHIFT		0
#define RTC_MODE2_MASK%s_SEL_MASK		0x07
/** @defgroup rtc_mode2_mask%s_sel SEL Alarm Mask Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode0_gp%s MODE0GP%s General Purpose
@{*/


/**@}*/

/** @defgroup rtc_mode1_gp%s MODE1GP%s General Purpose
@{*/


/**@}*/

/** @defgroup rtc_mode2_gp%s MODE2GP%s General Purpose
@{*/


/**@}*/
